---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsFailed
source: html/acb05e43-e442-b9b6-d7dc-41d276ac9176.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomsFailed Property

[Room] computations only succeeded without considering the following elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomsFailed { get; }
```